-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- 생성 시간: 19-10-20 06:33
-- 서버 버전: 5.7.26
-- PHP 버전: 5.6.40

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 데이터베이스: `edu`
--

-- --------------------------------------------------------

--
-- 테이블 구조 `tbl_attach`
--

DROP TABLE IF EXISTS `tbl_attach`;
CREATE TABLE IF NOT EXISTS `tbl_attach` (
  `full_name` varchar(150) NOT NULL,
  `bno` int(11) NOT NULL,
  `regdate` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`full_name`),
  KEY `fk_board_attach` (`bno`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `tbl_attach`
--

INSERT INTO `tbl_attach` (`full_name`, `bno`, `regdate`) VALUES
('/2019/10/20/s_6628ae49-d5d6-4911-a79e-5728b513cfb6_웹툰사이트.jpg', 205, '2019-10-20 02:10:47'),
('/2019/10/20/s_cf415fbe-754b-4d47-9ecd-0339438dc24f_logo.png', 205, '2019-10-20 02:10:47');

-- --------------------------------------------------------

--
-- 테이블 구조 `tbl_board`
--

DROP TABLE IF EXISTS `tbl_board`;
CREATE TABLE IF NOT EXISTS `tbl_board` (
  `bno` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(200) NOT NULL,
  `content` text,
  `writer` varchar(50) NOT NULL,
  `regdate` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `view_count` int(11) DEFAULT '0',
  `reply_count` int(11) DEFAULT '0',
  PRIMARY KEY (`bno`)
) ENGINE=InnoDB AUTO_INCREMENT=226 DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `tbl_board`
--

INSERT INTO `tbl_board` (`bno`, `title`, `content`, `writer`, `regdate`, `update_date`, `view_count`, `reply_count`) VALUES
(1, '수정된 글입니다.', '수정 테스트 ', 'user00', '2019-10-10 03:20:01', '2019-10-10 03:20:01', 0, 0),
(3, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-10 03:25:36', '2019-10-10 03:25:36', 0, 0),
(4, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-10 03:26:56', '2019-10-10 03:26:56', 0, 0),
(5, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-10 03:29:36', '2019-10-10 03:29:36', 0, 0),
(6, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-11 07:29:18', '2019-10-11 07:29:18', 0, 0),
(7, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-11 07:30:37', '2019-10-11 07:30:37', 0, 0),
(8, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-11 09:37:53', '2019-10-11 09:37:53', 0, 0),
(9, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-11 09:41:14', '2019-10-11 09:41:14', 0, 0),
(11, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-13 05:10:37', '2019-10-13 05:10:37', 0, 0),
(12, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-13 05:11:52', '2019-10-13 05:11:52', 0, 0),
(13, '홈페이지 오픈', '1234', 'kim ilguk', '2019-10-13 05:17:05', '2019-10-13 05:17:05', 0, 0),
(14, '홈페이지 오픈', 'ㅅㄷㄴㅅ', 'kim ilguk', '2019-10-13 05:17:24', '2019-10-13 05:17:24', 0, 0),
(15, '홈페이지 오픈 테스트', '내용:\r\n홈페이지 오픈 테스트', 'kim ilguk', '2019-10-13 05:28:59', '2019-10-19 11:09:52', 108, 11),
(27, '수정된 글입니다.', '수정 테스트 ', 'user00', '2019-10-19 03:14:55', '2019-10-19 03:14:55', 0, 0),
(28, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:14:55', '2019-10-19 03:14:55', 0, 0),
(29, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:14:55', '2019-10-19 03:14:55', 0, 0),
(30, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:14:55', '2019-10-19 03:14:55', 0, 0),
(31, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:14:55', '2019-10-19 03:14:55', 0, 0),
(32, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:14:55', '2019-10-19 03:14:55', 0, 0),
(33, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:14:55', '2019-10-19 03:14:55', 0, 0),
(34, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:14:55', '2019-10-19 03:14:55', 0, 0),
(35, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 03:14:55', '2019-10-19 03:14:55', 0, 0),
(36, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 03:14:55', '2019-10-19 03:14:55', 0, 0),
(37, '홈페이지 오픈', '1234', 'kim ilguk', '2019-10-19 03:14:55', '2019-10-19 03:14:55', 0, 0),
(38, '홈페이지 오픈', 'ㅅㄷㄴㅅ', 'kim ilguk', '2019-10-19 03:14:55', '2019-10-19 03:14:55', 0, 0),
(39, '홈페이지 오픈 테스트', '내용:\r\n홈페이지 오픈 테스트', 'kim ilguk', '2019-10-19 03:14:55', '2019-10-19 03:14:55', 0, 0),
(40, '수정된 글입니다.', '수정 테스트 ', 'user00', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(41, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(42, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(43, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(44, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(45, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(46, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(47, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(48, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(49, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(50, '홈페이지 오픈', '1234', 'kim ilguk', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(51, '홈페이지 오픈', 'ㅅㄷㄴㅅ', 'kim ilguk', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(52, '홈페이지 오픈 테스트', '내용:\r\n홈페이지 오픈 테스트', 'kim ilguk', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(53, '수정된 글입니다.', '수정 테스트 ', 'user00', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(54, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(55, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(56, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(57, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(58, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(59, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(60, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(61, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(62, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(63, '홈페이지 오픈', '1234', 'kim ilguk', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(64, '홈페이지 오픈', 'ㅅㄷㄴㅅ', 'kim ilguk', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(65, '홈페이지 오픈 테스트', '내용:\r\n홈페이지 오픈 테스트', 'kim ilguk', '2019-10-19 03:15:35', '2019-10-19 03:15:35', 0, 0),
(66, '수정된 글입니다.', '수정 테스트 ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(67, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(68, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(69, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(70, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(71, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(72, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(73, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(74, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(75, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(76, '홈페이지 오픈', '1234', 'kim ilguk', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(77, '홈페이지 오픈', 'ㅅㄷㄴㅅ', 'kim ilguk', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(79, '수정된 글입니다.', '수정 테스트 ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(80, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(81, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(82, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(83, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(84, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(85, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(86, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(87, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(88, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(89, '홈페이지 오픈', '1234', 'kim ilguk', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(90, '홈페이지 오픈', 'ㅅㄷㄴㅅ', 'kim ilguk', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(92, '수정된 글입니다.', '수정 테스트 ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(93, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(94, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(95, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(96, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(97, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(98, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(99, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(100, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(101, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(102, '홈페이지 오픈', '1234', 'kim ilguk', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(103, '홈페이지 오픈', 'ㅅㄷㄴㅅ', 'kim ilguk', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(104, '홈페이지 오픈 테스트', '내용:\r\n홈페이지 오픈 테스트', 'kim ilguk', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(105, '수정된 글입니다.', '수정 테스트 ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(106, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(107, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(108, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(109, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(110, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(111, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(112, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(113, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(114, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(115, '홈페이지 오픈', '1234', 'kim ilguk', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(116, '홈페이지 오픈', 'ㅅㄷㄴㅅ', 'kim ilguk', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(117, '홈페이지 오픈 테스트', '내용:\r\n홈페이지 오픈 테스트', 'kim ilguk', '2019-10-19 08:58:09', '2019-10-19 08:58:09', 0, 0),
(118, '수정된 글입니다.', '수정 테스트 ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(119, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(120, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(121, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 09:31:25', 1, 0),
(122, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(123, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(124, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(125, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(126, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(127, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(128, '홈페이지 오픈', '1234', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(129, '홈페이지 오픈', 'ㅅㄷㄴㅅ', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(130, '홈페이지 오픈 테스트', '내용:\r\n홈페이지 오픈 테스트', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(131, '수정된 글입니다.', '수정 테스트 ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(132, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(133, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(134, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(135, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(136, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(137, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(138, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(139, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(140, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(141, '홈페이지 오픈', '1234', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(142, '홈페이지 오픈', 'ㅅㄷㄴㅅ', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(143, '홈페이지 오픈 테스트', '내용:\r\n홈페이지 오픈 테스트', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(144, '수정된 글입니다.', '수정 테스트 ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(145, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(146, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(147, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(148, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(149, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(150, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(151, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(152, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(153, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(154, '홈페이지 오픈', '1234', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(155, '홈페이지 오픈', 'ㅅㄷㄴㅅ', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(156, '홈페이지 오픈 테스트', '내용:\r\n홈페이지 오픈 테스트', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(157, '수정된 글입니다.', '수정 테스트 ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(158, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(159, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(160, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(161, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(162, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(163, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(164, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(165, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(166, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(167, '홈페이지 오픈', '1234', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(168, '홈페이지 오픈', 'ㅅㄷㄴㅅ', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(169, '홈페이지 오픈 테스트', '내용:\r\n홈페이지 오픈 테스트', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(170, '수정된 글입니다.', '수정 테스트 ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(171, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(172, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(173, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(174, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(175, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(176, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(177, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(178, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(179, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(181, '홈페이지 오픈', 'ㅅㄷㄴㅅ', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(182, '홈페이지 오픈 테스트', '내용:\r\n홈페이지 오픈 테스트', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(183, '수정된 글입니다.', '수정 테스트 ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(184, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(185, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(186, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(187, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(188, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(189, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(191, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:18', '2019-10-19 09:44:02', 2, 0),
(192, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(193, '홈페이지 오픈', '1234', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(194, '홈페이지 오픈', 'ㅅㄷㄴㅅ', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(195, '홈페이지 오픈 테스트', '내용:\r\n홈페이지 오픈 테스트', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(196, '수정된 글입니다.', '수정 테스트 ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(197, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(198, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(199, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(200, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(201, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 09:43:26', 1, 0),
(202, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(203, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(204, '홈페이지 오픈', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(205, '첨부파일 테스트', '내용 입력\r\n입니다.', '김일국', '2019-10-19 08:58:18', '2019-10-20 02:39:35', 37, 0),
(206, '홈페이지 오픈', '1234', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(207, '홈페이지 오픈', 'ㅅㄷㄴㅅ', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(208, '홈페이지 오픈 테스트', '내용:\r\n홈페이지 오픈 테스트', 'kim ilguk', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(209, '수정된 글입니다.', '수정 테스트 ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(210, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(211, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(212, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(213, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(214, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-19 08:58:18', 0, 0),
(215, '새로운 글을 넣습니다. ', '새로운 글을 넣습니다. ', 'user00', '2019-10-19 08:58:18', '2019-10-20 02:42:20', 1, 0);

-- --------------------------------------------------------

--
-- 테이블 구조 `tbl_member`
--

DROP TABLE IF EXISTS `tbl_member`;
CREATE TABLE IF NOT EXISTS `tbl_member` (
  `user_id` varchar(50) NOT NULL,
  `user_pw` varchar(255) NOT NULL,
  `user_name` varchar(50) NOT NULL,
  `email` varchar(100) DEFAULT NULL,
  `point` int(11) NOT NULL DEFAULT '0',
  `enabled` tinyint(1) NOT NULL DEFAULT '0',
  `levels` varchar(50) NOT NULL DEFAULT 'ROLE_USER',
  `reg_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '등록일',
  `update_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `tbl_member`
--

INSERT INTO `tbl_member` (`user_id`, `user_pw`, `user_name`, `email`, `point`, `enabled`, `levels`, `reg_date`, `update_date`) VALUES
('user02', '$2a$10$kIqR/PTloYan/MRNiEsy6uYO6OCHVmAKR4kflVKQkJ345nqTiuGeO', 'user02', 'user02@edu.com', 0, 1, 'ROLE_ADMIN', '2019-10-15 10:41:44', '2019-10-15 10:41:44');

-- --------------------------------------------------------

--
-- 테이블 구조 `tbl_reply`
--

DROP TABLE IF EXISTS `tbl_reply`;
CREATE TABLE IF NOT EXISTS `tbl_reply` (
  `rno` int(11) NOT NULL AUTO_INCREMENT,
  `bno` int(11) NOT NULL DEFAULT '0',
  `replytext` varchar(1000) NOT NULL,
  `replyer` varchar(50) NOT NULL,
  `regdate` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`rno`),
  KEY `fk_board` (`bno`)
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `tbl_reply`
--

INSERT INTO `tbl_reply` (`rno`, `bno`, `replytext`, `replyer`, `regdate`, `update_date`) VALUES
(1, 15, '1:댓글을 수정   MOD', 'user02', '2019-10-17 02:39:01', '2019-10-18 01:52:51'),
(5, 15, '댓글 내용 테스트 입니다.', 'test2', '2019-10-17 09:12:31', '2019-10-18 06:16:21'),
(7, 15, 'REPLY TEXT5', 'test5', '2019-10-17 10:01:34', '2019-10-17 10:01:34'),
(8, 15, 'REPLY TEXT6', 'test6', '2019-10-17 10:01:42', '2019-10-17 10:01:42'),
(9, 15, 'REPLY TEXT7', 'test6', '2019-10-17 10:02:06', '2019-10-17 10:02:06'),
(10, 15, 'REPLY TEXT8', 'test6', '2019-10-17 10:02:16', '2019-10-17 10:02:16'),
(11, 15, 'REPLY TEXT9', 'test6', '2019-10-17 10:02:31', '2019-10-17 10:02:31'),
(12, 15, 'REPLY TEXT10', 'test6', '2019-10-17 10:02:49', '2019-10-17 10:02:49'),
(13, 15, 'REPLY TEXT11', 'test6', '2019-10-17 10:02:56', '2019-10-17 10:02:56'),
(14, 15, 'REPLY TEXT14', 'REPLYER', '2019-10-18 00:12:52', '2019-10-18 06:11:17'),
(15, 15, '테스트 댓글 내용 입니다.15', '사용자', '2019-10-18 06:14:46', '2019-10-18 06:35:28');

--
-- 덤프된 테이블의 제약사항
--

--
-- 테이블의 제약사항 `tbl_attach`
--
ALTER TABLE `tbl_attach`
  ADD CONSTRAINT `fk_board_attach` FOREIGN KEY (`bno`) REFERENCES `tbl_board` (`bno`);

--
-- 테이블의 제약사항 `tbl_reply`
--
ALTER TABLE `tbl_reply`
  ADD CONSTRAINT `fk_board` FOREIGN KEY (`bno`) REFERENCES `tbl_board` (`bno`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;